app/views/recipes/_form.html.erb

    <%= form.label :kind_id %>
    <%= collection_select(:recipe, :kind_id, Kind.all, :id, :name, {:include_blank => true}, {class:"form-control"}) %>
---
SELECT `kinds`.* FROM `kinds`