app/views/recipes/index.html.erb

SELECT COUNT(*) FROM `ingredients` WHERE `ingredients`.`recipe_id` = 8
---
        <td><%= recipe.kind.name %></td>
        <td><%= recipe.ingredients.count %></td>