app/views/recipes/show.html.erb

    <tbody>
      <% @recipe.ingredients.each do |i| %>
---
SELECT `ingredients`.* FROM `ingredients` WHERE `ingredients`.`recipe_id` = 2