app/controllers/recipes_controller.rb

SELECT  `recipes`.* FROM `recipes` LIMIT 7 OFFSET 0
SELECT COUNT(*) FROM `recipes`
---
  def index
    @recipes = Recipe.all.page(params[:page]).per(7)

INSERT INTO `recipes` (`user_id`, `preparation`, `created_at`, `updated_at`, `kind_id`, `name`) VALUES (1, 'vai no supermercado e compra já pronto', '2018-07-19 13:03:22', '2018-07-19 13:03:22', 5, 'biscoito')
---
  def create
    @recipe = Recipe.new(recipe_params)
    @recipe.user_id = current_user.id

    respond_to do |format|
      if @recipe.save

DELETE FROM `recipes` WHERE `recipes`.`id` = 1
---
  def destroy
    @recipe.destroy

SELECT  `recipes`.* FROM `recipes` WHERE `recipes`.`id` = 1 LIMIT 1
---
    def set_recipe
      @recipe = Recipe.find(params[:id])