app/controllers/witch_controller.rb

SELECT  `recipes`.* FROM `recipes` WHERE `recipes`.`user_id` = 1 LIMIT 7 OFFSET 0
SELECT COUNT(*) FROM `recipes` WHERE `recipes`.`user_id` = 15
---
  def myrecipes
    @recipes = current_user.recipes.page(params[:page]).per(7)