app/views/witch/myrecipes.html.erb

SELECT COUNT(*) FROM `ingredients` WHERE `ingredients`.`recipe_id` = 59
---
        <td><%= recipe.kind.name %></td>
        <td><%= recipe.ingredients.count %></td>